{
    "gigId":"roche-nimblegen",
    "gigName":"roche-nimblegen",
    "title":"Software Engineer III",
    "employer":"Roche Nimblegen Inc.",
    "employerUrl":"http://nimblegen.com",
    "blurb":"Delivered core functionality for DIVA, a desktop application for analysis of DNA micro-array results. Wrote a binary data engine capable of IO sufficient to power statistical analyses in R for both 32- and 64-bit architectures.",
    "cityState":"Madison WI",
    "methodology":"waterfall",
    "result":"Shipped",
    "startDate":1205791200000,
    "endDate":1281963600000,
    "durationInMillis":76172400000,
    "team":"The DEVA team was comprised of 3 full-time developers, 1-2 QA pros, 1 UX/UCD specialist and 1 project manager.",
    "sdlcProcess":"Roche ran a waterfall process, but did so while emphasizing User Centered Design. Requirements were determined by Marketing and driven by a cross-section of internal stakeholders. Requirements were cataloged in a document that was finalized late in the development process.",
    "contributions":[
        {
            "name":"IO engine",
            "description":"Designed and developed a NIO-powered binary IO engine capable of moving large data and annotation sets to and from disk in a manner capable of powering memory-intensive statistical algorithms on both 32- and 64-bit platforms."
        },
        {
            "name":"DAO layer",
            "description":"Designed and developed DAO access framework, powered by Spring's JdbcTemplate, which provided generic implementations of standard CRUD operations across numerous data types."
        },
        {
            "name":"User Centered Design",
            "description":"Participated in the implementation of a robust User Centered Design process, including the production and testing of paper and partial prototypes."
        },
        {
            "name":"Text search",
            "description":"Designed and developed a system for searching large (on the order of a few GB) annotation data sets with Apache Lucene and quickly returning relevant results to the user."
        },
        {
            "name":"Graphical UI",
            "description":"Developed UI elements that enable user interaction with complex data analysis workflows."
        },
        {
            "name":"Swing widgets",
            "description":"Designed and developed various Swing widgets used by the application."
        },
        {
            "name":"R shim",
            "description":"Designed and developed a system for \"shimming out\" R and it's viral GPL-license from DEVA, which is proprietary so that data and algorithms could be sent between processes."
        }
    ],
    "leadership":[
        "Frequently presented at development group meetings."
        , "Participated in continuous revision of application requirements document."
        , "Consistently performed and advocated for efficient development practices."
    ]
}